In [3]:
import pandas as pd

df = pd.read_csv(r"C:\Users\lapto\Downloads\ventas_productos.csv")
df

    Producto  Precio  Ventas  Ingreso
0   Vainilla     150      20     3000
1  Chocolate     180      35     6300
2      Fresa     160      25     4000
3      Mango     170      30     5100
4       Oreo     200      15     3000

In [4]:
ventas_por_producto = df.groupby("Producto")["Ventas"].sum()
ventas_por_producto

Producto
Chocolate    35
Fresa        25
Mango        30
Oreo         15
Vainilla     20
Name: Ventas, dtype: int64

In [5]:
ingreso_por_producto = df.groupby("Producto")["Ingreso"].sum()
ingreso_por_producto

Producto
Chocolate    6300
Fresa        4000
Mango        5100
Oreo         3000
Vainilla     3000
Name: Ingreso, dtype: int64

In [6]:
resumen = df.groupby("Producto").agg({
    "Ventas": "sum",
    "Ingreso": "sum",
    "Precio": "mean"
})

resumen

           Ventas  Ingreso  Precio
Producto
Chocolate      35     6300   180.0
Fresa          25     4000   160.0
Mango          30     5100   170.0
Oreo           15     3000   200.0
Vainilla       20     3000   150.0

In [7]:
pivot = pd.pivot_table(
    df,
    values="Ingreso",
    index="Producto",
    aggfunc="sum"
)

pivot

           Ingreso
Producto
Chocolate     6300
Fresa         4000
Mango         5100
Oreo          3000
Vainilla      3000

In [8]:
pivot.sort_values(by="Ingreso", ascending=False)

           Ingreso
Producto
Chocolate     6300
Mango         5100
Fresa         4000
Oreo          3000
Vainilla      3000

## ðŸ“Š AnÃ¡lisis Avanzado con pandas

El uso de groupby y pivot_table permitiÃ³ resumir eficientemente las ventas.
Estos anÃ¡lisis ayudan a identificar productos de alto rendimiento y optimizar decisiones comerciales.